emacs/.emacs.d/synthmacs/synthmacs-general-evil.el
;; [[file:../synthmacs.org::*General][General:1]]
