emacs/.emacs.d/synthmacs/synthmacs-programming.el
;; [[file:../synthmacs.org::*LSP][LSP:1]]
