emacs/.emacs.d/synthmacs.org
** init.el: startup optimization
:PROPERTIES:
:CUSTOM_ID: h:E6162DC2-7E1C-4843-8448-FF104A444B40
:header-args: :emacs-lisp :tangle init.el
:END:
Taken from DOOM's init
#+BEGIN_SRC emacs-lisp
  ;;; init.el --- Personal configuration file -*- lexical-binding: t; no-byte-compile: t; -*-
;; NOTE: init.el is now generated from synthmacs.org.  Please edit that file instead

;; `file-name-handler-alist' is consulted on every `require', `load' and various
;; path/io functions. You get a minor speed up by nooping this. However, this
;; may cause problems on builds of Emacs where its site lisp files aren't
;; byte-compiled and we're forced to load the *.el.gz files (e.g. on Alpine)
(unless (daemonp)
  (defvar doom--initial-file-name-handler-alist file-name-handler-alist)
  (setq file-name-handler-alist nil)
  ;; Restore `file-name-handler-alist' later, because it is needed for handling
  ;; encrypted or compressed files, among other things.
  (defun doom-reset-file-handler-alist-h ()
    ;; Re-add rather than `setq', because changes to `file-name-handler-alist'
    ;; since startup ought to be preserved.
    (dolist (handler file-name-handler-alist)
      (add-to-list 'doom--initial-file-name-handler-alist handler))
    (setq file-name-handler-alist doom--initial-file-name-handler-alist))
  (add-hook 'emacs-startup-hook #'doom-reset-file-handler-alist-h)
  (add-hook 'after-init-hook '(lambda ()
				;; restore after startup
				(setq gc-cons-threshold 16777216
				      gc-cons-percentage 0.1)))
  )

;; Ensure Synthmacs is running out of this file's directory
(setq user-emacs-directory (file-truename (file-name-directory load-file-name)))
#+END_SRC

** init.el: load modules
:PROPERTIES:
:CUSTOM_ID: h:7B22A4F3-49A1-4848-A185-B4EEA060EECE
:header-args: :emacs-lisp :tangle init.el
:END:
#+begin_src emacs-lisp
(message "SynthMacs is powering up, please be patient...")

;; (add-to-list 'load-path "~/.emacs.d/synthmacs/")
(add-to-list 'load-path (expand-file-name "synthmacs" user-emacs-directory))

(let ((file-name-handler-alist nil)
      (gc-cons-threshold 100000000))

  (require 'synthmacs-core)
  (require 'synthmacs-package-management)
  (require 'synthmacs-general-evil)
  (require 'synthmacs-ui)
  (require 'synthmacs-org)
  (require 'synthmacs-completion-framework)
  (require 'synthmacs-tools)
  (require 'synthmacs-programming)
  ;;(require 'synthmacs-lang-clojure)
  ;;(require 'synthmacs-lang-haskell)
  ;;(require 'synthmacs-lang-html)
  ;;(require 'synthmacs-lang-lisp)
  ;;(require 'synthmacs-lang-markdown)
  ;;(require 'synthmacs-lang-rust)
  ;;(require 'synthmacs-lang-swift)
  ;;(require 'synthmacs-lang-yaml)
  )

;;; init.el ends here
#+end_src

* Package Management
:PROPERTIES:
:CUSTOM_ID: h:F8B6E0EE-7BBD-4F7F-B31E-44DE7B43AA39
:END:

** Bootstrap Straight and straight-use-package
:PROPERTIES:
:CUSTOM_ID: h:686F7A63-013E-48ED-AC56-DF39BD398E20
:header-args: :emacs-lisp :tangle ./synthmacs/synthmacs-package-management.el
:END:
Some rules/conventions:
- Prefer ~:init~ to ~:custom~. Prefer multiple ~setq~ expressions to one.
- Default to ~:defer t~, use ~:demand~ to force loading
- When packages do not require installation e.g. ~dired~, we need ~:straight (:type built-in)~ 
- If you specify ~:commands~, they will be autoloaded and the package will be loaded when the commands are first executed
  + If you use ~:general~ and bind commands to keys it will automatically load the package on first invokation

#+BEGIN_SRC emacs-lisp
(setq straight-repository-branch "develop")
(setq straight-use-package-by-default t)
;; (setq straight-recipes-gnu-elpa-use-mirror t)
;; (setq straight-check-for-modifications '(check-on-save find-when-checking))
;;(setq straight-check-for-modifications nil)
(setq use-package-always-ensure t)
;; (setq use-package-always-defer t)

(setq straight-repository-branch "develop")
(defvar bootstrap-version)
(let ((bootstrap-file
       (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
      (bootstrap-version 6))
  (unless (file-exists-p bootstrap-file)
    (with-current-buffer
	(url-retrieve-synchronously
	 "https://raw.githubusercontent.com/radian-software/straight.el/develop/install.el"
	 'silent 'inhibit-cookies)
      (goto-char (point-max))
      (eval-print-last-sexp)))
  (load bootstrap-file nil 'nomessage))

;; Install use-package
(straight-use-package 'use-package)
#+END_SRC

* Core Emacs Setup
:PROPERTIES:
:CUSTOM_ID: h:3D38D8F0-1B85-4265-9941-77A3A2FA235B
:header-args: :emacs-lisp :tangle ./synthmacs/synthmacs-core.el
:END:

** Emacs Setup
:PROPERTIES:
:CUSTOM_ID: h:51921EE3-AFC6-44A1-A700-316815CBFF49
:END:
Some general things to set up:

#+begin_src emacs-lisp
(use-package emacs
  :init
  (setq inhibit-startup-message t
	inhibit-startup-screen t
        initial-scratch-message nil
        sentence-end-double-space nil
        ring-bell-function 'ignore
        frame-resize-pixelwise t)

  (setq read-process-output-max (* 1024 1024)) ;; 1mb

  ;; less noise when compiling elisp
  (setq byte-compile-warnings '(not free-vars unresolved noruntime lexical make-local))
  (setq native-comp-async-report-warnings-errors nil)
  (setq load-prefer-newer t)

  ;; write over selected text on input... like all modern editors do
  ;;(delete-selection-mode t)
  )
#+end_src

*** User setup
:PROPERTIES:
:CUSTOM_ID: h:C6B442E5-589B-43CA-B3F5-FE0A53CDBA66
:END:
Who is using Synthmacs?
#+begin_src emacs-lisp
(use-package emacs
  :init
  (setq user-full-name "roux g. buciu"
        user-mail-address "roux@fringe.foundation"))
#+end_src

*** "Yes or no" prompts
:PROPERTIES:
:CUSTOM_ID: h:1FFE6051-E84B-438A-9FA9-BB6A6EFBE77F
:END:
They are annoying and it's much more idiomatic to type y or n for these types of things anyway. So let's make sure Synthmacs confornms to this.

#+begin_src emacs-lisp
(use-package emacs
  :init
  (defalias 'yes-or-no-p 'y-or-n-p))
#+end_src

*** UTF-8 file encoding
:PROPERTIES:
:CUSTOM_ID: h:6E819D29-764F-4F26-B5CB-20766CE6579D
:END:
Sometimes file encoding is really messed up, so we make sure to default to UTF-8 for everything!

#+begin_src emacs-lisp
(use-package emacs
  :init
  (set-charset-priority 'unicode)
  (setq locale-coding-system 'utf-8
        coding-system-for-read 'utf-8
        coding-system-for-write 'utf-8)
  (set-terminal-coding-system 'utf-8)
  (set-keyboard-coding-system 'utf-8)
  (set-selection-coding-system 'utf-8)
  (prefer-coding-system 'utf-8)
  (setq default-process-coding-system '(utf-8-unix . utf-8-unix)))
#+end_src

*** Recent files
:PROPERTIES:
:CUSTOM_ID: h:9E1EAAC3-9A7D-48C6-95D3-B98A8D8C1861
:END:
Recent files. Enable them for nice navigation from the dashboard, ~consult-recent-files~, and so on.
#+begin_src emacs-lisp
(use-package emacs
  :init
  (recentf-mode t)
  (setq recentf-exclude `(,(expand-file-name "straight/build/" user-emacs-directory)
                          ,(expand-file-name "eln-cache/" user-emacs-directory)
                          ,(expand-file-name "etc/" user-emacs-directory)
                          ,(expand-file-name "var/" user-emacs-directory)))
  (setq recentf-max-menu-items 10)
  (setq recentf-max-saved-items 10)
  )
#+end_src

*** ESC key!
:PROPERTIES:
:CUSTOM_ID: h:2A391835-2D45-4E8E-87C1-823E3B5402A8
:END:
The ESC key should not be a modifier, but should behave as per its namesake.
#+begin_src emacs-lisp
(use-package emacs
  :init
  (global-set-key (kbd "<escape>") 'keyboard-escape-quit))
#+end_src

*** Custom file
:PROPERTIES:
:CUSTOM_ID: h:7569FED9-DB11-4C0A-972A-9AD1AC3E1667
:END:
Don't persist a custom file, this bites me more than it helps, honestly.

#+begin_src emacs-lisp
(use-package emacs
  :init
  (setq custom-file (make-temp-file "")) ; use a temp file as a placeholder
  (setq custom-safe-themes t)            ; mark all themes as safe, since we can't persist now
  (setq enable-local-variables :all)     ; fix =defvar= warnings
  )
#+end_src

*** Autosaves
:PROPERTIES:
:CUSTOM_ID: h:DD2D8AFF-4FB3-4157-8A5E-F8A71509C869
:END:
Autosaving is great, but stop littering the file system with backup files all over the place. Maybe I'll really want this in the future. For now, it's a hard no.
#+begin_src emacs-lisp
(use-package emacs
  :init
  (setq make-backup-files nil
        auto-save-default t
        create-lockfiles nil))
#+end_src

*** Symlinks
:PROPERTIES:
:CUSTOM_ID: h:D92031FF-2EE5-4894-B10E-7E3B36E5876D
:END:
I work with symlinks a fair bit of the time. Let's make sure that when I am working with them, I'm going to the actual file, because, really, that's what I want to edit.
#+begin_src emacs-lisp
(use-package emacs
  :init
  ;; follow symlinks 
  (setq vc-follow-symlinks t))
#+end_src

*** Window chrome
:PROPERTIES:
:CUSTOM_ID: h:B186EAC9-0310-4C0D-93A4-3F3B9D9C96A8
:END:
Hide it if we're in a window. I go back and forth on hiding the menu. I like it being there, but I've never used it, so why is it there?
#+begin_src emacs-lisp
(use-package emacs
  :init
  (when (window-system)
    (tool-bar-mode -1)
    (tooltip-mode -1)
    (toggle-scroll-bar -1)
    (set-fringe-mode 10)
    ;; (menu-bar-mode -1)
    )
  )
    #+end_src

*** Scrolling behaviours
:PROPERTIES:
:CUSTOM_ID: h:7B6C9DD0-B689-471C-904B-299C56F20AC7
:END:
#+begin_src emacs-lisp
(use-package emacs
  :init
  ;; Set scroll margin, but emulate vim scroll behaviour
  (setq scroll-conservatively 101
	scroll-margin 5
	scroll-preserve-screen-position 't)

  ;; Enables having the line the cursor is on be highlighted
  (global-hl-line-mode 1)

  ;; enable winner mode globally for undo/redo window layout changes
  (winner-mode t)

  (show-paren-mode t)
  )

#+end_src

*** Line numbers
:PROPERTIES:
:CUSTOM_ID: h:AEE6BF5E-C716-41A4-80E6-45512D31F9B5
:END:
#+begin_src emacs-lisp
(use-package emacs
  :init
  ;; ------------------ Line Numbering ---------------------
  ;; set type of line numbering (global variable)
  (setq display-line-numbers-type 'relative)
  ;; activate line numbering in all buffers/modes
  (global-display-line-numbers-mode 1)

  (dolist (mode '(org-mode-hook
		  term-mode-hook
		  eshell-mode-hook))
    (add-hook mode (lambda () (display-line-numbers-mode 0))))

  ;; Activate line numbering in programming modes
  ;; (add-hook 'prog-mode-hook 'display-line-numbers-mode)
  )
#+end_src

*** Fill column & modeline column info
:PROPERTIES:
:CUSTOM_ID: h:9F8FCA21-383E-42FA-BA7D-59DD3ECEB950
:END:
#+begin_src emacs-lisp
(use-package emacs
  :init
  (setq-default fill-column 85)
  (global-display-fill-column-indicator-mode)

  ;; Columns number in the modeline
  (setq column-number-mode t)
  )
#+end_src

