emacs/.emacs.d/synthmacs/synthmacs-core.el
  (setq inhibit-startup-message t
	inhibit-startup-screen t
        initial-scratch-message nil
        sentence-end-double-space nil
        ring-bell-function 'ignore
        frame-resize-pixelwise t)

  (setq read-process-output-max (* 1024 1024)) ;; 1mb

  ;; less noise when compiling elisp
  (setq byte-compile-warnings '(not free-vars unresolved noruntime lexical make-local))
  (setq native-comp-async-report-warnings-errors nil)
  (setq load-prefer-newer t)

  ;; write over selected text on input... like all modern editors do
  ;;(delete-selection-mode t)
  )
;; Emacs Setup:1 ends here

;; [[file:../synthmacs.org::*User setup][User setup:1]]
(use-package emacs
  :init
  (setq user-full-name "roux g. buciu"
        user-mail-address "roux@fringe.foundation"))
;; User setup:1 ends here

;; [[file:../synthmacs.org::*"Yes or no" prompts]["Yes or no" prompts:1]]
(use-package emacs
  :init
  (defalias 'yes-or-no-p 'y-or-n-p))
;; "Yes or no" prompts:1 ends here

;; [[file:../synthmacs.org::*UTF-8 file encoding][UTF-8 file encoding:1]]
(use-package emacs
  :init
  (set-charset-priority 'unicode)
  (setq locale-coding-system 'utf-8
        coding-system-for-read 'utf-8
        coding-system-for-write 'utf-8)
  (set-terminal-coding-system 'utf-8)
  (set-keyboard-coding-system 'utf-8)
  (set-selection-coding-system 'utf-8)
  (prefer-coding-system 'utf-8)
  (setq default-process-coding-system '(utf-8-unix . utf-8-unix)))
;; UTF-8 file encoding:1 ends here

;; [[file:../synthmacs.org::*Recent files][Recent files:1]]
(use-package emacs
  :init
  (recentf-mode t)
  (setq recentf-exclude `(,(expand-file-name "straight/build/" user-emacs-directory)
                          ,(expand-file-name "eln-cache/" user-emacs-directory)
                          ,(expand-file-name "etc/" user-emacs-directory)
                          ,(expand-file-name "var/" user-emacs-directory)))
  (setq recentf-max-menu-items 10)
  (setq recentf-max-saved-items 10)
  )
;; Recent files:1 ends here

;; [[file:../synthmacs.org::*ESC key!][ESC key!:1]]
(use-package emacs
  :init
  (global-set-key (kbd "<escape>") 'keyboard-escape-quit))
;; ESC key!:1 ends here

;; [[file:../synthmacs.org::*Custom file][Custom file:1]]
(use-package emacs
  :init
  (setq custom-file (make-temp-file "")) ; use a temp file as a placeholder
  (setq custom-safe-themes t)            ; mark all themes as safe, since we can't persist now
  (setq enable-local-variables :all)     ; fix =defvar= warnings
  )
;; Custom file:1 ends here

;; [[file:../synthmacs.org::*Autosaves][Autosaves:1]]
(use-package emacs
  :init
  (setq make-backup-files nil
        auto-save-default t
        create-lockfiles nil))
;; Autosaves:1 ends here

;; [[file:../synthmacs.org::*Symlinks][Symlinks:1]]
(use-package emacs
  :init
  ;; follow symlinks 
  (setq vc-follow-symlinks t))
;; Symlinks:1 ends here

;; [[file:../synthmacs.org::*Window chrome][Window chrome:1]]
(use-package emacs
  :init
  (when (window-system)
    (tool-bar-mode -1)
    (tooltip-mode -1)
    (toggle-scroll-bar -1)
    (set-fringe-mode 10)
    ;; (menu-bar-mode -1)
    )
  )
;; Window chrome:1 ends here

;; [[file:../synthmacs.org::*Scrolling behaviours][Scrolling behaviours:1]]
(use-package emacs
  :init
  ;; Set scroll margin, but emulate vim scroll behaviour
  (setq scroll-conservatively 101
	scroll-margin 5
	scroll-preserve-screen-position 't)

  ;; Enables having the line the cursor is on be highlighted
  (global-hl-line-mode 1)

  ;; enable winner mode globally for undo/redo window layout changes
  (winner-mode t)

  (show-paren-mode t)
  )
;; Scrolling behaviours:1 ends here

;; [[file:../synthmacs.org::*Line numbers][Line numbers:1]]
(use-package emacs
  :init
  ;; ------------------ Line Numbering ---------------------
  ;; set type of line numbering (global variable)
  (setq display-line-numbers-type 'relative)
  ;; activate line numbering in all buffers/modes
  (global-display-line-numbers-mode 1)

  (dolist (mode '(org-mode-hook
		  term-mode-hook
		  eshell-mode-hook))
    (add-hook mode (lambda () (display-line-numbers-mode 0))))

  ;; Activate line numbering in programming modes
  ;; (add-hook 'prog-mode-hook 'display-line-numbers-mode)
  )
;; Line numbers:1 ends here

;; [[file:../synthmacs.org::*Fill column & modeline column info][Fill column & modeline column info:1]]
(use-package emacs
  :init
  (setq-default fill-column 85)
  (global-display-fill-column-indicator-mode)

  ;; Columns number in the modeline
  (setq column-number-mode t)
  )
;; Fill column & modeline column info:1 ends here

;; [[file:../synthmacs.org::*Other][Other:1]]
(use-package emacs
  :init
