emacs/.emacs.d/synthmacs.org
*** <C-h> in the minibuffer while completing a file name
:PROPERTIES:
:CUSTOM_ID: h:14B4AD1F-CC7B-42BF-8C28-33019F387080
:END:
From SystemCrafters

#+begin_src emacs-lisp
(defun synthmacs/minibuffer-backwards-kill (arg)
  "When minibuffer is completing a file name, delete up to parent
folder; otherwise, delete a character backwards."
  (interactive "p")
  (if minibuffer-completing-file-name
      (if (string-match-p "/." (minibuffer-contents))
	  (zap-up-to-char (- arg) ?/)
	(delete-minibuffer-contents))
    (delete-backwards-char arg)))
#+end_src

*** Symbols
:PROPERTIES:
:CUSTOM_ID: h:86C4D8A2-9E75-46C9-AE4B-F4DBBDC9AA61
:END:
#+begin_src emacs-lisp
(defun synthmacs/my-add-pretty-symbol ()
  (setq prettify-symbols-alist
        '(
          ("lambda" . 955) ; λ
          ;; ("->" . 8594)    ; →
          ;; ("=>" . 8658)    ; ⇒
          ;; ("map" . 8614)   ; ↦
          )))
#+end_src

*** Quit (but save before doing so!)
:PROPERTIES:
:CUSTOM_ID: h:12B3E275-99FC-4184-9314-44B02CD78861
:END:
#+begin_src emacs-lisp
(defun synthmacs/prompt-kill-emacs ()
  "Prompt to save changed buffers and exit Synthmacs"
  (interactive)
  (save-some-buffers nil t)
  (kill-emacs))

#+end_src

** COMMENT Garbage collector magic hack
:PROPERTIES:
:CUSTOM_ID: h:42E8D107-2954-49CB-8E38-33CF300BABDE
:END:
Inspired by DOOMs use of this to manage garbage collection

#+begin_src emacs-lisp
(use-package gcmh
  :demand
  :config
  (gcmh-mode 1))
#+end_src

** COMMENT no-littering
:PROPERTIES:
:CUSTOM_ID: h:23600A76-1CDE-48FE-9024-163E861F2F0C
:END:
Basically tries to clean up the ~emacs.d~ directory by creating consistent placement for files.

#+begin_src emacs-lisp
(use-package no-littering
  :demand
  :config
  (with-eval-after-load 'recentf
    (add-to-list 'recentf-exclude no-littering-var-directory)
    (add-to-list 'recentf-exclude no-littering-etc-directory))
  )
#+end_src

** Auto-pair paranthesis
:PROPERTIES:
:CUSTOM_ID: h:7B34AC43-8F07-4754-9360-0592CBDBAF9F
:END:
In programming, missing parens and the like are a pain to track down. Let's automate some of that to decrease the likely hood of this actually happening.

#+begin_src emacs-lisp
(use-package emacs
  :hook
  ((org-mode . (lambda () (synthmacs/add-local-electric-pairs '(;(?= . ?=)
                                                         (?~ . ?~))))))
  :init
  (electric-pair-mode +1)
  (setq electric-pair-preserve-balance nil)

  ;; mode-specific local-electric pairs
  (defconst synthmacs/default-electric-pairs electric-pair-pairs)
  (defun synthmacs/add-local-electric-pairs (pairs)
    "Example usage: 
    (add-hook 'jupyter-org-interaction-mode '(lambda () (set-local-electric-pairs '())))
    "
    (setq-local electric-pair-pairs (append synthmacs/default-electric-pairs pairs))
    (setq-local electric-pair-text-pairs electric-pair-pairs))

  ;; disable auto pairing for <  >
  (add-function :before-until electric-pair-inhibit-predicate
                (lambda (c) (eq c ?<   ;; >
                                )))
  )  
#+end_src

** COMMENT xref
:PROPERTIES:
:CUSTOM_ID: h:088A31CF-3AEF-4AF4-B60D-B2793FCDDB94
:END:
#+begin_src emacs-lisp
(use-package xref
  :straight (:type built-in)
  :init
  (setq xref-prompt-for-identifier nil) ;; always find references of symbol at point
  ;; configured in consult
  ;; (setq xref-show-definitions-function #'xref-show-definitions-completing-read)
  ;; (setq xref-show-xrefs-function #'xref-show-definitions-buffer) ; for grep and the like
  ;; (setq xref-file-name-display 'project-relative)
  ;; (setq xref-search-program 'grep)
  )
#+end_src

* Keybindings: General & EVIL mode
:PROPERTIES:
:CUSTOM_ID: h:D7FB11B6-67B4-4275-B0CC-E218C65C411E
:header-args: :emacs-lisp :tangle ./synthmacs/synthmacs-general-evil.el
:END:

** General
:PROPERTIES:
:CUSTOM_ID: h:871AF14C-473E-4227-B4BF-13E984BE1E7D
:END:
Here, we load ~general~ and define bindings for generic commands (~find-file~ for example). The commands provided by packages should be binded in the ~use-package~ block, thanks to the ~:general~ keyword.

NOTE: We need to load ~general~ before ~evil~, otherwise the ~:general~ keyword in the use-package blocks won't work.

#+begin_src emacs-lisp
(use-package general
  :demand t
  :config
  (general-evil-setup)

  ;; set up 'SPC' as the global leader key
  (general-create-definer synthmacs/leader-keys
    :states '(normal insert visual emacs)
    :keymaps 'override
    :prefix "SPC" ;; set leader
    :global-prefix "M-SPC") ;; access leader in insert mode

  (general-create-definer synthmacs/local-leader-keys
    :states '(normal visual)
    :keymaps 'override
    :prefix ","
    :global-prefix "SPC m")
  )
#+end_src

** General keybindings
:PROPERTIES:
:CUSTOM_ID: h:F8198789-D8ED-49CF-88F5-C6619539211E
:END:

*** Application bindings
:PROPERTIES:
:CUSTOM_ID: h:919D720B-1ACC-441F-9822-8FAB69EB625F
:END:
#+begin_src emacs-lisp
(synthmacs/leader-keys
  "a" '(:ignore t :wk "applications"))
#+end_src

*** Buffer bindings
:PROPERTIES:
:CUSTOM_ID: h:9624A127-D219-4FAA-A4B6-582996655F01
:END:
#+begin_src emacs-lisp
(synthmacs/leader-keys
  "b" '(:ignore t :wk "buffer")
  "bb" '(switch-to-buffer :wk "Switch buffer")
  "bd" '(kill-this-buffer :wk "Kill this buffer")
  "bh" '(dashboard-refresh-buffer :wk "Home buffer")
  "bm" '((lambda ()
	   (interactive)
	   (switch-to-buffer " *Message-Log*"))
	 :wk "Messages buffer")
  "bn" '(next-buffer :wk "Next buffer")
  "bp" '(previous-buffer :wk "Previous buffer")
  "br" '(revert-buffer :wk "Reload buffer")
  "bs" '(scratch-buffer :wk "Scratch buffer")
  "bu" '(synthmacs/reopen-killed-buffer :wk "Reopen last killed buffer"))
#+end_src

*** Compilation bindings
:PROPERTIES:
:CUSTOM_ID: h:BC80000B-14BD-435B-AF41-69ECCE16AC08
:END:
#+begin_src emacs-lisp
(synthmacs/leader-keys
  "c" '(:ignore t :wk "compile")
  "cf" '(find-file :wk "Find file"))
#+end_src

*** Debug bindings
:PROPERTIES:
:CUSTOM_ID: h:FF739FE8-70DB-4DBB-B009-1ABE294AB393
:END:
#+begin_src emacs-lisp
(synthmacs/leader-keys
  "d" '(:ignore t :wk "debug")
  "df" '(find-file :wk "Find file"))
#+end_src

*** Error bindings
:PROPERTIES:
:CUSTOM_ID: h:AC006610-1BD5-4962-8319-FE8B08D0DFC5
:END:
#+begin_src emacs-lisp
(synthmacs/leader-keys
  "e" '(:ignore t :wk "errors")
  "ef" '(find-file :wk "Find file"))
#+end_src

*** Files bindings
:PROPERTIES:
:CUSTOM_ID: h:AD60DD6B-FDFB-4D31-BE5B-B984E2944598
:END:
#+begin_src emacs-lisp
(synthmacs/leader-keys
  "f" '(:ignore t :wk "files")
  "f." '(find-file-at-point :wk "find-file-at-point")
  "ff" '(find-file :wk "find-file")
  "fl" '(find-file-literally :wk "find-file-literally")
  "fr" '(consult-recent-file :wk "recent file")
  "fR" '(synthmacs/rename-current-buffer-file :wk "Rename file")
  "fs" '(save-buffer :wk "save file"))

(synthmacs/leader-keys
  "fy" '(:ignore t :wk "yank")
  "fyb" '(synthmacs//copy-buffer-name :wk "buffer name")
  "fyd" '(synthmacs//copy-directory-path :wk "directory path")
  "fyf" '(synthmacs//copy-file-path :wk "file path")
  "fyl" '(synthmacs//copy-file-path-with-line :wk "file path with line number")
  "fyn" '(synthmacs//copy-file-name :wk "file name")
  "fyN" '(synthmacs//copy-file-name-base :wk "file name without extension"))

(synthmacs/leader-keys
  "fe" '(:ignore t :wk "Emacs Files")
  "fed" '((lambda ()
	    (interactive)
	    (find-file "~/.emacs.d/synthmacs.org"))
	  :wk "synthmacs.org"))
#+end_src

*** Frame bindings
:PROPERTIES:
:CUSTOM_ID: h:4C073FB0-DDD2-4648-98CF-A108B7733096
:END:
#+begin_src emacs-lisp
(synthmacs/leader-keys
  "F" '(:ignore t :wk "Frames")
  "Fd" '(delete-frame :wk "delete-frame")
  "FD" '(delete-other-frames :wk "delete-other-frames")
  "Fn" '(make-frame :wk "make-frame"))
#+end_src

*** Git/VCS bindings
:PROPERTIES:
:CUSTOM_ID: h:DA032070-22DA-4C6D-815E-147617662953
:END:
#+begin_src emacs-lisp
(synthmacs/leader-keys
  "g" '(:ignore t :wk "git"))
#+end_src

*** Help bindings
:PROPERTIES:
:CUSTOM_ID: h:7D9257A5-58D9-4B53-93EC-D1962282E1AA
:END:
#+begin_src emacs-lisp
(synthmacs/leader-keys
  "h" '(:ignore t :wk "help")
  "hp" '(describe-package :wk "describe-package")
  "hM" '(describe-mode :wk "describe-mode (Major)")
  "hm" '(describe-minor-mode :wk "describe-minor-mode")

  "hE" '(:ignore t :wk "Emacs")
  "hEf" '(view-emacs-FAQ :wk "view-emacs-faq")
  "hEm" '(info-emacs-manual :wk "info-emacs-manual")
  "hEn" '(view-emacs-news :wk "view-emacs-news")
  "hEp" '(view-emacs-problems :wk "view-emacs-problems")
  "hEt" '(view-emacs-todo :wk "view-emacs-todo"))
#+end_src

*** Jump bindings
:PROPERTIES:
:CUSTOM_ID: h:8EE273DF-ECFF-4C88-9F43-D5CDA596BE74
:END:
#+begin_src emacs-lisp
(synthmacs/leader-keys
  "j" '(:ignore t :wk "jump/join/split"))
#+end_src

*** M-x bindings
:PROPERTIES:
:CUSTOM_ID: h:B2BB706A-87A6-48AD-8B8D-5D514A3722AB
:END:
#+begin_src emacs-lisp
(synthmacs/leader-keys
  "SPC" '(:ignore t :wk "M-x")
  "SPC" '(execute-extended-command :wk "M-x")
  "TAB" '(synthmacs/alternate-buffer :wk "last buffer"))
;; "'" '(execute-extended-command :wk "open shell")
#+end_src

