emacs/.emacs.d/synthmacs/synthmacs-core.el

;; [[file:../synthmacs.org::*<C-h> in the minibuffer while completing a file name][<C-h> in the minibuffer while completing a file name:1]]
(defun synthmacs/minibuffer-backwards-kill (arg)
  "When minibuffer is completing a file name, delete up to parent
folder; otherwise, delete a character backwards."
  (interactive "p")
  (if minibuffer-completing-file-name
      (if (string-match-p "/." (minibuffer-contents))
	  (zap-up-to-char (- arg) ?/)
	(delete-minibuffer-contents))
    (delete-backwards-char arg)))
;; <C-h> in the minibuffer while completing a file name:1 ends here

;; [[file:../synthmacs.org::*Symbols][Symbols:1]]
(defun synthmacs/my-add-pretty-symbol ()
  (setq prettify-symbols-alist
        '(
          ("lambda" . 955) ; λ
          ;; ("->" . 8594)    ; →
          ;; ("=>" . 8658)    ; ⇒
          ;; ("map" . 8614)   ; ↦
          )))
;; Symbols:1 ends here

;; [[file:../synthmacs.org::*Quit (but save before doing so!)][Quit (but save before doing so!):1]]
(defun synthmacs/prompt-kill-emacs ()
  "Prompt to save changed buffers and exit Synthmacs"
  (interactive)
  (save-some-buffers nil t)
  (kill-emacs))
;; Quit (but save before doing so!):1 ends here

;; [[file:../synthmacs.org::*Auto-pair paranthesis][Auto-pair paranthesis:1]]
(use-package emacs
  :hook
  ((org-mode . (lambda () (synthmacs/add-local-electric-pairs '(;(?= . ?=)
                                                         (?~ . ?~))))))
  :init
  (electric-pair-mode +1)
  (setq electric-pair-preserve-balance nil)

  ;; mode-specific local-electric pairs
  (defconst synthmacs/default-electric-pairs electric-pair-pairs)
  (defun synthmacs/add-local-electric-pairs (pairs)
    "Example usage: 
    (add-hook 'jupyter-org-interaction-mode '(lambda () (set-local-electric-pairs '())))
    "
    (setq-local electric-pair-pairs (append synthmacs/default-electric-pairs pairs))
    (setq-local electric-pair-text-pairs electric-pair-pairs))

  ;; disable auto pairing for <  >
  (add-function :before-until electric-pair-inhibit-predicate
                (lambda (c) (eq c ?<   ;; >
                                )))
  )
;; Auto-pair paranthesis:1 ends here

;; [[file:../synthmacs.org::*synthmacs-core][synthmacs-core:1]]
(provide 'synthmacs-core)
