emacs/.emacs.d/synthmacs.org
*** Major-mode bindings
:PROPERTIES:
:CUSTOM_ID: h:6004A24A-C951-41FB-A2D3-42AAD6DC2143
:END:
#+begin_src emacs-lisp
(synthmacs/leader-keys
  "m" '(:ignore t :wk "major mode"))
#+end_src

*** Org bindings
:PROPERTIES:
:CUSTOM_ID: h:FF0E16D7-1239-4A2D-A81D-CB45A1019ED0
:END:
#+begin_src emacs-lisp
(synthmacs/leader-keys
  "o" '(:ignore t :wk "org"))
#+end_src

*** Project bindings
:PROPERTIES:
:CUSTOM_ID: h:492B2741-254E-4FFC-BB18-C79AEF74D7A1
:END:
#+begin_src emacs-lisp
(synthmacs/leader-keys
  "p" '(:ignore t :wk "projects"))
#+end_src

*** Quit bindings
:PROPERTIES:
:CUSTOM_ID: h:01C7280C-69EF-47D6-B50B-6362A9D82BDF
:END:
#+begin_src emacs-lisp
(synthmacs/leader-keys
  "q" '(:ignore t :wk "quit")
  "qq" '(synthmacs/prompt-kill-emacs :wk "prompt-kill-emacs")
  "qs" '(save-buffers-kill-emacs :wk "save-buffers-kill-emacs")
  "qQ" '(kill-emacs :wk "kill-emacs")
  "qR" '(restart-emacs :wk "restart-emacs"))
#+end_src

*** Registers bindings
:PROPERTIES:
:CUSTOM_ID: h:4603106A-5ABD-4FD3-8EA0-F67A598CCB02
:END:
#+begin_src emacs-lisp
(synthmacs/leader-keys
  "r" '(:ignore t :wk "registers")
  "re" '(evil-show-registers :wk "evil-show-registers")
  "rk" '(consult-yank-from-kill-ring :wk "consult-yank-from-kill-ring"))
#+end_src

*** Search bindings
:PROPERTIES:
:CUSTOM_ID: h:1EB3AA9F-8F66-427D-A2B8-FE65730DF6A5
:END:
#+begin_src emacs-lisp
(synthmacs/leader-keys
  "s" '(:ignore t :wk "search")
  "sc" '(evil-ex-nohighlight :wk "clear-search-highlights"))
#+end_src

*** Toggles bindings
:PROPERTIES:
:CUSTOM_ID: h:5A330DCC-5B77-4C92-ACF1-5195ECBBDC32
:END:
#+begin_src emacs-lisp
(synthmacs/leader-keys
  "t" '(:ignore t :wk "toggles")
  "tc" '(global-display-fill-column-indicator-mode :wk "fill-column")
  "tp" '(smartparens-global-mode :wk "smartparens-global-mode")
  "tl" '(toggle-truncate-lines :wk "truncate-lines")
  "tv" '(visual-line-mode :wk "visual-line-mode")
  "tw" '(global-whitespace-mode :wk "global-whitespace-mode")
  "tz" '(zone :wk "zone"))
#+end_src

*** User bindings
:PROPERTIES:
:CUSTOM_ID: h:0F5F8697-278F-4363-B3DD-72E80F010402
:END:
#+begin_src emacs-lisp
(synthmacs/leader-keys
  "u" '(:ignore t :wk "user bindings"))
#+end_src

*** Window bindings
:PROPERTIES:
:CUSTOM_ID: h:7D0252BE-EDAD-42EE-837B-D216E21197BE
:END:
#+begin_src emacs-lisp
(synthmacs/leader-keys
  "w" '(:ignore t :wk "window")

  "wd" '(evil-window-delete :wk "delete-window")

  "ws" '(evil-window-split :wk "horizontal split window")
  "wv" '(evil-window-vsplit :wk "vertical split window")

  "wm" '(maximize-window :wk "maximize-window")

  ;; Window motions
  "wh" '(evil-window-left :wk "window left")
  "wj" '(evil-window-down :wk "window down")
  "wk" '(evil-window-up :wk "window up")
  "wl" '(evil-window-right :wk "window right")
  "wn" '(evil-window-next :wk "go to next window")
  "wp" '(evil-window-prev :wk "go to previous window")

  ;; Move Windows
  "wH" '(synthmacs/buf-move-left :wk "window move left")
  "wJ" '(synthmacs/buf-move-down :wk "window move down")
  "wK" '(synthmacs/buf-move-up :wk "window move up")
  "wL" '(synthmacs/buf-move-right :wk "window move right")

  "w{" '(shrink-window :wk "shrink-window")
  "w[" '(synthmacs/buf-move-down :wk "shrink-window-horizontally")
  "w}" '(synthmacs/buf-move-up :wk "expand-window")
  "w]" '(synthmacs/buf-move-right :wk "expand-window-horizontally"))
#+end_src

** Hydra
:PROPERTIES:
:CUSTOM_ID: h:E25DB824-33FC-457C-9547-B457A4019A0F
:END:
#+begin_src emacs-lisp
(use-package hydra
  :general
  (synthmacs/leader-keys
    "tf" '(hydra/text-scale/body :wk "font size")))

(defhydra hydra/text-scale (:timeout 7)
  "
^Zoom Menu
^^^^^^^^----------------------
_+_: text-scale-increase
_-_: text-scale-decrease
_q_: quit
"
  ("+" text-scale-increase)
  ("-" text-scale-decrease)
  ("q" nil :exit t))


;; Buffer menu
;; (defhydra hydra/buffer-menu (:color pink
;;                              :hint nil)
;;   "
;; ^Mark^             ^Unmark^           ^Actions^          ^Search
;; ^^^^^^^^-----------------------------------------------------------------
;; _m_: mark          _u_: unmark        _x_: execute       _R_: re-isearch
;; _s_: save          _U_: unmark up     _b_: bury          _I_: isearch
;; _d_: delete        ^ ^                _g_: refresh       _O_: multi-occur
;; _D_: delete up     ^ ^                _T_: files only: % -28`Buffer-menu-files-only
;; _~_: modified
;; "
;;   ("m" Buffer-menu-mark)
;;   ("u" Buffer-menu-unmark)
;;   ("U" Buffer-menu-backup-unmark)
;;   ("d" Buffer-menu-delete)
;;   ("D" Buffer-menu-delete-backwards)
;;   ("s" Buffer-menu-save)
;;   ("~" Buffer-menu-not-modified)
;;   ("x" Buffer-menu-execute)
;;   ("b" Buffer-menu-bury)
;;   ("g" revert-buffer)
;;   ("T" Buffer-menu-toggle-files-only)
;;   ("O" Buffer-menu-multi-occur :color blue)
;;   ("I" Buffer-menu-isearch-buffers :color blue)
;;   ("R" Buffer-menu-isearch-buffers-regexp :color blue)
;;   ("c" nil "cancel")
;;   ("v" Buffer-menu-select "select" :color blue)
;;   ("o" Buffer-menu-other-window "other-window" :color blue)
;;   ("q" quit-window "quit" :color blue))

;; (synthmacs/leader-keys
;;   "bl" '(buffer-menu :wk "buffer list"))

;; ;; More keymaps
;; (general-define-key
;;  :keymaps 'Buffer-menu-mode-map
;;  "C-?" 'hydra/buffer-menu/body)
#+end_src

