emacs/.emacs.d/synthmacs.org
** LSP
:PROPERTIES:
:CUSTOM_ID: h:222F2EE3-FD70-4274-AABC-759B5F7556C5
:END:
#+begin_src emacs-lisp
(use-package lsp-mode
  :commands (lsp lsp-deferred)
  :init
  ;; set prefix for lsp-command-keymap (few alternatives - "C-l", "C-c l")
  (setq lsp-keymap-prefix "C-c l")
  :hook
  (lsp-mode . lsp-enable-which-key-integration))

(use-package lsp-ui
  :hook (lsp-mode . lsp-ui-mode)
  :custom
  (lsp-ui-doc-position 'bottom))

(use-package lsp-treemacs
  :after lsp)

;; optionally if you want to use debugger
;; (use-package dap-mode)
;; (use-package dap-LANGUAGE) to load the dap adapter for your language
#+end_src

** Corfu
:PROPERTIES:
:CUSTOM_ID: h:4B6D88C2-0393-4462-9C06-37BD9160B415
:END:
#+begin_src emacs-lisp
(use-package corfu
  :straight (corfu :files (:defaults "extensions/*")
		   :includes (corfu-popupinfo))
  :hook (corfu-mode . corfu-popupinfo-mode)
  ;; Optional customizations
  :custom
  (corfu-cycle t)                ;; Enable cycling for `corfu-next/previous'
  (corfu-auto t)                 ;; Enable auto completion
  ;; (corfu-auto-delay 0.0)
  ;; (corfu-auto-prefix 0)
  (corfu-separator ?\s)          ;; Orderless field separator
  (corfu-quit-at-boundary nil)   ;; Never quit at completion boundary
  ;; (corfu-quit-no-match nil)      ;; Never quit, even if there is no match
  ;; (corfu-preview-current nil)    ;; Disable current candidate preview
  ;; (corfu-preselect 'prompt)      ;; Preselect the prompt
  ;; (corfu-on-exact-match nil)     ;; Configure handling of exact matches
  ;; (corfu-scroll-margin 5)        ;; Use scroll margin

  ;; Enable Corfu only for certain modes.
  ;; :hook ((prog-mode . corfu-mode)
  ;;        (shell-mode . corfu-mode)
  ;;        (eshell-mode . corfu-mode))

  (corfu-popupinfo-delay 1)
  (corfu-popupinfo-max-height 15)
  ;; Recommended: Enable Corfu globally.
  ;; This is recommended since Dabbrev can be used globally (M-/).
  ;; See also `corfu-exclude-modes'.
  :general
  (synthmacs/leader-keys
  "ta" '(global-corfu-mode :wk "auto-completion"))
  :init
  (global-corfu-mode)
  :config
  (keymap-set corfu-map "C-d" 'corfu-popupinfo-scroll-down)
  (keymap-set corfu-map "C-u" 'corfu-popupinfo-scroll-up)
  (keymap-set corfu-map "C-i" 'corfu-popupinfo-toggle))

;; A few more useful configurations...
(use-package emacs
  :init
  ;; TAB cycle if there are only few candidates
  (setq completion-cycle-threshold 3)

  ;; Emacs 28: Hide commands in M-x which do not apply to the current mode.
  ;; Corfu commands are hidden, since they are not supposed to be used via M-x.
  ;; (setq read-extended-command-predicate
  ;;       #'command-completion-default-include-p)

  ;; Enable indentation+completion using the TAB key.
  ;; `completion-at-point' is often bound to M-TAB.
  (setq tab-always-indent 'complete))

(use-package kind-icon
  :after corfu
  :custom
  (kind-icon-default-face 'corfu-default) ; to compute blended backgrounds correctly
  :config
  (add-to-list 'corfu-margin-formatters #'kind-icon-margin-formatter))
#+end_src

** COMMENT Dirvish
:PROPERTIES:
:CUSTOM_ID: h:895ADECA-8F1A-4FBB-A930-871EE0B6D4D8
:END:
#+begin_src emacs-lisp
(use-package dirvish
  :init
  (dirvish-override-dired-mode)
  :config
  (setq delete-by-moving-to-trash t
	dirvish-attributes
	'(all-the-icons file-size collapse subtree-state vc-state)
	dirvish-side-width 45
	dirvish-side-follow-mode t
	))

(synthmacs/leader-keys
  "fm" '(dirvish :wk "file manager")
  "ft" '(dirvish-side :wk "file tree"))

;; Addtional syntax highlighting for dired
(use-package diredfl
  :hook
  ((dired-mode . diredfl-mode)
   ;; highlight parent and directory preview as well
   (dirvish-directory-view-mode . diredfl-mode))
  :config
  (set-face-attribute 'diredfl-dir-name nil :bold t))
#+end_src

** Flycheck
:PROPERTIES:
:CUSTOM_ID: h:337359CD-0A1C-48AE-A141-36BFC0FE4641
:END:
#+begin_src emacs-lisp
(use-package flycheck
  :init (global-flycheck-mode))
#+end_src

** iMenu
:PROPERTIES:
:CUSTOM_ID: h:A05AB852-E81B-4B50-B873-6A3C2A917C08
:END:
#+begin_src emacs-lisp
(use-package imenu-list)

(synthmacs/leader-keys
  "ti" '(imenu-list-smart-toggle :wx "imenu-list-smart-toggle"))

#+end_src

** Snippets
:PROPERTIES:
:CUSTOM_ID: h:36F5A754-136E-4AA5-967D-358D69599D01
:END:
#+begin_src emacs-lisp
(use-package yasnippet)

;; (yas-reload-all)
(add-hook 'prog-mode-hook #'yas-minor-mode)

(use-package yasnippet-snippets)
(use-package common-lisp-snippets)
#+end_src

