emacs/.emacs.d/synthmacs.org
** Treesitter
:PROPERTIES:
:CUSTOM_ID: h:1A1DAD25-321C-4F90-A226-1C14A4F7A79F
:END:
#+begin_src emacs-lisp
(require 'treesit)

(use-package tree-sitter-langs)

;; Load the language bundle
(require 'tree-sitter-langs)

;; (setq treesit-language-source-alist
;;    '((bash "https://github.com/tree-sitter/tree-sitter-bash")
;;      (c "https://github.com/tree-sitter/tree-sitter-c")
;;      (cmake "https://github.com/uyha/tree-sitter-cmake")
;;      (clojure "https://github.com/sogaiu/tree-sitter-clojure")
;;      (commonlisp "https://github.com/theHamsta/tree-sitter-commonlisp")
;;      (css "https://github.com/tree-sitter/tree-sitter-css")
;;      (elixir "https://github.com/elixir-lang/tree-sitter-elixir")
;;      (elisp "https://github.com/Wilfred/tree-sitter-elisp")
;;      (go "https://github.com/tree-sitter/tree-sitter-go")
;;      (html "https://github.com/tree-sitter/tree-sitter-html")
;;      (haskell "https://github.com/tree-sitter/tree-sitter-haskell")
;;      (javascript "https://github.com/tree-sitter/tree-sitter-javascript" "master" "src")
;;      (json "https://github.com/tree-sitter/tree-sitter-json")
;;      (lua "https://github.com/Azganoth/tree-sitter-lua")
;;      (make "https://github.com/alemuller/tree-sitter-make")
;;      (markdown "https://github.com/ikatyang/tree-sitter-markdown")
;;      (objc "https://github.com/jiyee/tree-sitter-objc")
;;      ;; (ocaml "https://github.com/tree-sitter/tree-sitter-ocaml")
;;      (python "https://github.com/tree-sitter/tree-sitter-python")
;;      (racket "https://github.com/6cdh/tree-sitter-racket")
;;      (ruby "https://github.com/tree-sitter/tree-sitter-ruby")
;;      (rust "https://github.com/tree-sitter/tree-sitter-rust")
;;      (scheme "https://github.com/6cdh/tree-sitter-scheme")
;;      (sqlite "https://github.com/dhcmrlchtdj/tree-sitter-sqlite")
;;      (sql "https://github.com/m-novikov/tree-sitter-sql")
;;      ;; (swift "https://gitlab.com/woolsweater/tree-sitter-swifter")
;;      (toml "https://github.com/tree-sitter/tree-sitter-toml")
;;      (yaml "https://github.com/ikatyang/tree-sitter-yaml")
;;      (zig "https://github.com/maxxnino/tree-sitter-zig")))

;; (defun synthmacs/treesit-install-all-languages ()
;;     "Install all languages specified by `treesit-language-source-alist'."
;;     (interactive)
;;     (let ((languages (mapcar 'car treesit-language-source-alist)))
;;       (dolist (lang languages)
;; 	      (treesit-install-language-grammar lang)
;; 	      (message "`%s' parser was installed." lang)
;; 	      (sit-for 0.75))))

;; (add-hook 'c-mode-hook
;; 	  (lambda () (if (treesit-ready-p 'c t)
;; 		    (c-ts-mode)
;; 		  (c-mode))))

;; (add-hook 'common-lisp-mode-hook
;; 	  (lambda () (if (treesit-ready-p 'commonlisp t)
;; 		    (common-lisp-ts-mode)
;; 		  (common-lisp-mode))))

;; (add-hook 'clojure-mode-hook
;; 	  (lambda () (if (treesit-ready-p 'clojure t)
;; 		    (clojure-ts-mode)
;; 		  (clojure-mode))))

;; (add-hook 'css-mode-hook
;; 	  (lambda () (if (treesit-ready-p 'css t)
;; 		    (css-ts-mode)
;; 		  (css-mode))))

;; (add-hook 'html-mode-hook
;; 	  (lambda () (if (treesit-ready-p 'html t)
;; 		    (html-ts-mode)
;; 		  (html-mode))))

;; (add-hook 'haskell-mode-hook
;; 	  (lambda () (if (treesit-ready-p 'haskell t)
;; 		    (haskell-ts-mode)
;; 		  (haskell-mode))))

;; (add-hook 'javascript-mode-hook
;; 	  (lambda () (if (treesit-ready-p 'javascript t)
;; 		    (js-ts-mode)
;; 		  (javascript-mode))))

;; (add-hook 'js-json-mode-hook
;; 	  (lambda () (if (treesit-ready-p 'json t)
;; 		    (json-ts-mode)
;; 		  (js-json-mode))))

;; (add-hook 'python-mode-hook
;; 	  (lambda () (if (treesit-ready-p 'python t)
;; 		    (python-ts-mode)
;; 		  (python-mode))))

;; (add-hook 'sh-mode-hook
;; 	  (lambda () (if (treesit-ready-p 'bash t)
;; 		    (bash-ts-mode)
;; 		  (sh-mode))))
#+end_src

* Programming Languages
:PROPERTIES:
:CUSTOM_ID: h:732BA080-834D-49E0-967E-0D37CE1C6BA0
:END:

** Clojure
:PROPERTIES:
:CUSTOM_ID: h:FF09BB1E-5437-4AFF-A4F5-367B92AF76CC
:header-args:    :emacs-lisp :tangle ./synthmacs/synthmacs-lang-clojure.el
:END:
** Haskell
:PROPERTIES:
:CUSTOM_ID: h:28BA5E9F-6893-4E40-9F42-246F8731948C
:header-args:    :emacs-lisp :tangle ./synthmacs/synthmacs-lang-haskell.el
:END:
** HTML
:PROPERTIES:
:CUSTOM_ID: h:5561B91C-C61D-47D5-8320-9A559032C762
:header-args:    :emacs-lisp :tangle ./synthmacs/synthmacs-lang-html.el
:END:
** LISP
:PROPERTIES:
:CUSTOM_ID: h:2171FA3F-D9BC-4058-9442-6827BABFC2CE
:header-args:    :emacs-lisp :tangle ./synthmacs/synthmacs-lang-lisp.el
:END:
#+begin_src emacs-lisp
(use-package sly)

(use-package sly-macrostep)

(use-package sly-repl-ansi-color
  :init
  (add-to-list 'sly-contribs 'sly-repl-ansi-color))
#+end_src

** Markdown
:PROPERTIES:
:CUSTOM_ID: h:80E9702A-E2B6-44B5-A139-AD16C9B5D92F
:header-args:    :emacs-lisp :tangle ./synthmacs/synthmacs-lang-markdown.el
:END:
** Rust
:PROPERTIES:
:CUSTOM_ID: h:6355CFE4-6BA5-4134-BA38-74634F9FF919
:header-args:    :emacs-lisp :tangle ./synthmacs/synthmacs-lang-rust.el
:END:
** Swift
:PROPERTIES:
:CUSTOM_ID: h:4C66614A-ED5B-4771-96C3-E2C789282DC1
:header-args:    :emacs-lisp :tangle ./synthmacs/synthmacs-lang-swift.el
:END:
#+begin_src emacs-lisp
(use-package lsp-sourcekit
  :after lsp-mode
  :config
  (setq lsp-sourcekit-executable (string-trim (shell-command-to-string "xcrun --find sourcekit-lsp"))))

(use-package swift-mode
  :hook (swift-mode . (lambda () (lsp))))
#+end_src

** YAML
:PROPERTIES:
:CUSTOM_ID: h:0AB88184-7AE8-4232-B4A7-B8C4714B91D3
:header-args:    :emacs-lisp :tangle ./synthmacs/synthmacs-lang-yaml.el
:END:
* Provide modules
:PROPERTIES:
:CUSTOM_ID: h:754DFB20-B2AB-4750-9BDA-D24E8014C504
:END:

** synthmacs-core
:PROPERTIES:
:CUSTOM_ID: h:24A7FE78-E6B9-4C81-A2BE-6A049A8209AD
:header-args:    :emacs-lisp :tangle ./synthmacs/synthmacs-core.el
:END:
#+begin_src emacs-lisp
(provide 'synthmacs-core)
;;; synthmacs-core.el ends here
#+end_src

** synthmacs-package-management
:PROPERTIES:
:CUSTOM_ID: h:24A7FE78-E6B9-4C81-A2BE-6A049A8209AD
:header-args:    :emacs-lisp :tangle ./synthmacs/synthmacs-package-management.el
:END:
#+begin_src emacs-lisp
(provide 'synthmacs-package-management)
;;; synthmacs-package-management.el ends here
#+end_src

** synthmacs-general-evil
:PROPERTIES:
:CUSTOM_ID: h:24A7FE78-E6B9-4C81-A2BE-6A049A8209AD
:header-args:    :emacs-lisp :tangle ./synthmacs/synthmacs-general-evil.el
:END:
#+begin_src emacs-lisp
(provide 'synthmacs-general-evil)
;;; synthmacs-general-evil.el ends here
#+end_src

** synthmacs-org
:PROPERTIES:
:CUSTOM_ID: h:24A7FE78-E6B9-4C81-A2BE-6A049A8209AD
:header-args:    :emacs-lisp :tangle ./synthmacs/synthmacs-org.el
:END:
#+begin_src emacs-lisp
(provide 'synthmacs-org)
;;; synthmacs-org.el ends here
#+end_src

** synthmacs-ui
:PROPERTIES:
:CUSTOM_ID: h:24A7FE78-E6B9-4C81-A2BE-6A049A8209AD
:header-args:    :emacs-lisp :tangle ./synthmacs/synthmacs-ui.el
:END:
#+begin_src emacs-lisp
(provide 'synthmacs-ui)
;;; synthmacs-ui.el ends here
#+end_src

** synthmacs-completion-framework
:PROPERTIES:
:CUSTOM_ID: h:24A7FE78-E6B9-4C81-A2BE-6A049A8209AD
:header-args:    :emacs-lisp :tangle ./synthmacs/synthmacs-completion-framework.el
:END:
#+begin_src emacs-lisp
(provide 'synthmacs-completion-framework)
;;; synthmacs-completion-framework.el ends here
#+end_src

** synthmacs-tools
:PROPERTIES:
:CUSTOM_ID: h:24A7FE78-E6B9-4C81-A2BE-6A049A8209AD
:header-args:    :emacs-lisp :tangle ./synthmacs/synthmacs-tools.el
:END:
#+begin_src emacs-lisp
(provide 'synthmacs-tools)
;;; synthmacs-tools.el ends here
#+end_src

** synthmacs-programming
:PROPERTIES:
:CUSTOM_ID: h:24A7FE78-E6B9-4C81-A2BE-6A049A8209AD
:header-args:    :emacs-lisp :tangle ./synthmacs/synthmacs-programming.el
:END:
#+begin_src emacs-lisp
(provide 'synthmacs-programming)
;;; synthmacs-programming.el ends here
#+end_src

** Programming Languages
:PROPERTIES:
:CUSTOM_ID: h:320148C4-896F-4FFF-90CD-08E91DCCED9E
:END:

*** synthmacs-lang-clojure
:PROPERTIES:
:CUSTOM_ID: h:24A7FE78-E6B9-4C81-A2BE-6A049A8209AD
:header-args:    :emacs-lisp :tangle ./synthmacs/synthmacs-lang-clojure.el
:END:
#+begin_src emacs-lisp
(provide 'synthmacs-lang-clojure)
;;; synthmacs-lang-clojure.el ends here
#+end_src

*** synthmacs-lang-haskell
:PROPERTIES:
:CUSTOM_ID: h:24A7FE78-E6B9-4C81-A2BE-6A049A8209AD
:header-args:    :emacs-lisp :tangle ./synthmacs/synthmacs-lang-haskell.el
:END:
#+begin_src emacs-lisp
(provide 'synthmacs-lang-haskell)
;;; synthmacs-lang-haskell.el ends here
#+end_src

*** synthmacs-lang-html
:PROPERTIES:
:CUSTOM_ID: h:24A7FE78-E6B9-4C81-A2BE-6A049A8209AD
:header-args:    :emacs-lisp :tangle ./synthmacs/synthmacs-lang-html.el
:END:
#+begin_src emacs-lisp
(provide 'synthmacs-lang-html)
;;; synthmacs-lang-html.el ends here
#+end_src

*** synthmacs-lang-lisp
:PROPERTIES:
:CUSTOM_ID: h:24A7FE78-E6B9-4C81-A2BE-6A049A8209AD
:header-args:    :emacs-lisp :tangle ./synthmacs/synthmacs-lang-lisp.el
:END:
#+begin_src emacs-lisp
(provide 'synthmacs-lang-lisp)
;;; synthmacs-lang-lisp.el ends here
#+end_src

*** synthmacs-lang-markdown
:PROPERTIES:
:CUSTOM_ID: h:24A7FE78-E6B9-4C81-A2BE-6A049A8209AD
:header-args:    :emacs-lisp :tangle ./synthmacs/synthmacs-lang-markdown.el
:END:
#+begin_src emacs-lisp
(provide 'synthmacs-lang-markdown)
;;; synthmacs-lang-markdown.el ends here
#+end_src

*** synthmacs-lang-rust
:PROPERTIES:
:CUSTOM_ID: h:24A7FE78-E6B9-4C81-A2BE-6A049A8209AD
:header-args:    :emacs-lisp :tangle ./synthmacs/synthmacs-lang-rust.el
:END:
#+begin_src emacs-lisp
(provide 'synthmacs-lang-rust)
;;; synthmacs-lang-rust.el ends here
#+end_src

*** synthmacs-lang-swift
:PROPERTIES:
:CUSTOM_ID: h:24A7FE78-E6B9-4C81-A2BE-6A049A8209AD
:header-args:    :emacs-lisp :tangle ./synthmacs/synthmacs-lang-swift.el
:END:
#+begin_src emacs-lisp
(provide 'synthmacs-lang-swift)
;;; synthmacs-lang-swift.el ends here
#+end_src

*** synthmacs-lang-yaml
:PROPERTIES:
:CUSTOM_ID: h:24A7FE78-E6B9-4C81-A2BE-6A049A8209AD
:header-args:    :emacs-lisp :tangle ./synthmacs/synthmacs-lang-yaml.el
:END:
#+begin_src emacs-lisp
(provide 'synthmacs-lang-yaml)
;;; synthmacs-lang-yaml.el ends here
#+end_src

* COMMENT Local variables
:PROPERTIES:
:CUSTOM_ID: h:8CE072CD-CA85-4E53-B672-E0AC74E4E4EC
:END:
# Local Variables:
# eval: (add-hook 'after-save-hook (lambda ()(progn (synthmacs/org-add-ids-to-headlines-in-file) (synthmacs/tangle-config))) nil t)
# End:
