emacs/.emacs.d/synthmacs/synthmacs-core.el
;;; synthmacs-core.el ends here
;; synthmacs-core:1 ends here
