emacs/.emacs.d/synthmacs/synthmacs-general-evil.el
;;; synthmacs-general-evil.el ends here
;; synthmacs-general-evil:1 ends here
